<?php

use Bitrix\Crm\ContactTable;
use Bitrix\Main\UserPhoneAuthTable;
use Starlabs\Project\Grooming;
use Starlabs\Project\SmartProcess;
use Starlabs\Project\Iblock;
use Starlabs\Project\Helpers\Utils;
use Starlabs\Project\Personal\Assistant;
use Starlabs\Project\Personal\Master;
use Starlabs\Project\WorkSchedule\Model\WorkScheduleTable;
use Starlabs\Project\WorkSchedule\ScheduleList;
use Starlabs\Tools\Helpers\Log;
use Starlabs\Project\Grooming\Deal;


require($_SERVER["DOCUMENT_ROOT"] . "/bitrix/header.php");
\Bitrix\Main\Loader::includeModule('crm');
//создание базы контактов
/*$fieldsMapper = [
    "UF_CRM_1486394709", //порода
    "UF_CRM_1486394648", //тип животного(список)
    "UF_CRM_1486394187", //Адрес доставки
    "UF_CRM_1486394322",//удобный способ связи(список)
    "UF_CRM_1486394467",//клуб (список)
    "UF_CRM_1486394722",//Кличка
    "UF_CRM_1486394756",//Дата рождения питомца
    "UF_CRM_1486394909",//Комментарии
    "UF_CRM_1486395038",//салон (список)
    "UF_CRM_1486395061",//мастер
    "UF_CRM_1486746590",//номер карты клуба
    "UF_CRM_1486746743",//статус ученика (список)
    "UF_CRM_1486746782",//тип курса
    "UF_CRM_1486746789",//комментарий
    "UF_CRM_1494239965",//СМС с др (да нет)
];
$arBreedsNew =
    Array
    (
        "акита ину" => 48,
        "алабай" => 52,
        "аляскинский маламут" => 49,
        "американская акита " => 50,
        "афганская борзая" => 51,
        "африканский бурбуль" => 330,
        "аффен-пинчер" => 331,
        "бассенджи" => 53,
        "бассет-хаунд" => 54,
        "бедлингтон терьер" => 55,
        "бельгийская овчарка" => 56,
        "бернский зенненхунд" => 57,
        "бивер йоркширский терьер" => 58,
        "бигль" => 59,
        "бишон" => 60,
        "бладхаунд" => 332,
        "бобтейл" => 61,
        "боксер" => 62,
        "болонез" => 63,
        "бордер колли" => 64,
        "бордер терьер" => 65,
        "бордосский дог" => 333,
        "бриар" => 334,
        "брюсельский грифон" => 66,
        "буль мастиф" => 70,
        "бульдог американский" => 67,
        "бульдог английский" => 68,
        "бультерьер" => 69,
        "вельш терьер" => 71,
        "вельш-корги" => 72,
        "вест-хайленд-вайт терьер" => 73,
        "восточно-европейская овчарка" => 74,
        "грейхаунд" => 335,
        "далматин" => 75,
        "джек-рассел терьер (парсен-рассел)" => 76,
        "джек-рассел терьер жесткошер." => 77,
        "доберман" => 78,
        "дог" => 79,
        "дратхаар" => 80,
        "дэнди даймонд терьер" => 336,
        "ирландский волкодав" => 81,
        "ирландский терьер" => 82,
        "йоркипу" => 84,
        "йоркширский терьер" => 85,
        "йоркширский терьер (от 6 кг)" => 179,
        "кавказская овчарка" => 87,
        "кеесхонд" => 89,
        "керн терьер" => 337,
        "керри-блю терьер" => 88,
        "китайская хохлатая голая" => 90,
        "китайская хохлатая пуховка" => 91,
        "кламбер спаниель" => 338,
        "коккер спаниель американский" => 92,
        "коккер спаниель английский" => 93,
        "колли гладкошерстная" => 94,
        "колли длинношерстная" => 95,
        "кошки" => 329,
        "кролик" => 328,
        "курцхаар" => 96,
        "лабрадор" => 97,
        "лабрадудель" => 98,
        "лайка (большая)от 15кг" => 99,
        "лайка (маленькая) до 15кг" => 180,
        "левретка" => 100,
        "леонбергер" => 101,
        "лхасский апсо" => 102,
        "мальтез" => 106,
        "мальтипу" => 107,
        "мастино-неаполетано" => 103,
        "мастиф английский" => 104,
        "мастиф испанский" => 105,
        "мейн-кун" => 327,
        "метис (более 20 кг)" => 182,
        "метис (до 20 кг)" => 181,
        "метис (до 7 кг)" => 108,
        "миттельшнауцер" => 109,
        "мопс" => 110,
        "моск.длинношерст. той-терьер" => 111,
        "московский дракон" => 112,
        "немецкая овчарка" => 114,
        "норвич терьер" => 115,
        "норфолк терьер" => 116,
        "ньюфаундленд" => 113,
        "папильон" => 117,
        "пекинес" => 118,
        "петербургская орхидея" => 121,
        "пиренейская собака" => 119,
        "пит буль" => 120,
        "пти-брабансон" => 339,
        "пудель карликовый до 36 см " => 124,
        "пудель королевский" => 122,
        "пудель малый (средний) от 36см" => 123,
        "пудель той до 28 см" => 125,
        "пшеничный терьер" => 126,
        "ретривер (голден)" => 127,
        "риджбек" => 128,
        "ризеншнауцер" => 129,
        "ротвейлер" => 130,
        "русская борзая" => 131,
        "русская цветная болонка" => 132,
        "русский спаниель" => 133,
        "салюки" => 340,
        "самоед" => 134,
        "сенбернар" => 135,
        "сеттер" => 136,
        "сиба ину (шиба ину)" => 138,
        "сибирский хаски" => 137,
        "силихем терьер" => 341,
        "скай терьер " => 139,
        "скотч терьер" => 141,
        "спаниель кавалер кинг чарльз" => 140,
        "спрингер спаниель" => 342,
        "среднеазиатская овчарка" => 142,
        "стаффордшир терьер" => 143,
        "такса гладкошерстная стандарт" => 144,
        "такса длинношерстная стандарт" => 145,
        "такса жесткошерстная карликовая" => 147,
        "такса жесткошерстная стандарт" => 146,
        "такса кроличья гладкошерстная" => 148,
        "такса кроличья длинношерстная" => 149,
        "тибетский мастиф" => 150,
        "тибетский терьер (метис)" => 151,
        "той-терьер гладкошерстный" => 152,
        "той-терьер длинношерстный" => 153,
        "фараонова собака" => 343,
        "фила-бразильеро" => 344,
        "фландрский бувье" => 345,
        "фокс терьер гладкошерстный" => 154,
        "фокс терьер жесткошерстный" => 155,
        "французский бульдог" => 156,
        "ханаанская собака" => 346,
        "хин японский" => 157,
        "цверг пинчер" => 159,
        "цвергшнауцер" => 158,
        "чау-чау" => 160,
        "черный терьер" => 161,
        "чи-хуа-хуа гладкошерстная" => 162,
        "чи-хуа-хуа длинношерстная" => 163,
        "шарпей" => 164,
        "шелти" => 165,
        "ши-пу" => 167,
        "ши-тцу" => 166,
        "шпиц вольф" => 170,
        "шпиц карликов. померанец (до23см)" => 168,
        "шпиц малый (до 29см)" => 169,
        "эрдельтерьер" => 171,
        "эстонская гончая" => 172,
        "южнорусская овчарка" => 173,
        "ягд терьер" => 174,
    );

foreach ($arBreedsNew as $breedName => $id) {
    $nospace = str_replace([' ', '.', ',', '-'], ['','','','',],$breedName);
    $artrimBreed[$id] = $nospace;
}

$arMap = [
    "йорк" => 85,
    "карлпудель" => 124,
    "шпиц" => 170,
    "пудель" => 123,
    "грифон" => 66,
    "мальтезе" => 106,
    "метис" => 181,
    "биверйорк" => 58,
    "такса" => 145,
    "чихуа" => 162,
    "большойпудель" => 122,
    "кот" => 329,
    "кошка" => 329,
    "корги" => 72,
    "тойпудель" => 125,
    "мейкун" => 327,
    "амкокер" => 92,
    "хаски" => 137,
    "сибаину" => 138,
    "чихуа(длинош)" => 163,
    "голретривер" => 127,
    "голден" => 127,
    "балонка" => 132,
    "кошкаметис" => 329,
    "маламут" => 49,
    "котметис" => 329,
    "малыйпудель" => 123,
    "карпудель" => 124,
    "японхин" => 157,
    "котшотл" => 329,
];
$arSalonsMap = [
    86 => 33,
    84 => 34,
    88 => 36,
    323 => 35,
    325 => 37,
];
$arMastersMap = [
    206 => 15,
    168 => 13,
    343 => 14,
    14 => 4,
    30 => 5,
    22 => 6,
    16 => 3,
    216 => 18,
    433 => 10,
    441 => 16,
    439 => 19,
    435 => 20,
    647 => 5,
];
$arTypesMap = [
    68 => 176,
    70 => 177,
    72 => 178,
];
$arResult = [];
try {
    $Rest = new \Starlabs\Project\Crest\CRest();
    $listItems = [];
    $arBreeds = [];
    $listTotal = \Starlabs\Project\CRest\CRestCurrent::call('crm.contact.list', ["filter" => ["!UF_CRM_1486394709" => false, "!UF_CRM_1486394648" => false]])['total'];
    for ($i = 0; $i < $listTotal / 50; $i++) {
        $params['start'] = $i * 50;
        $params["select"] = ["NAME","ID","LAST_NAME", "PHONE", "UF_CRM_1486394709", "UF_CRM_1486394648", "UF_CRM_1486394756", "UF_CRM_1486395038", "UF_CRM_1486395061", "UF_CRM_1486394722"];
        $params["filter"] = ["!UF_CRM_1486394709" => false, "!UF_CRM_1486394648" => false];
        $Rest->addBatchCall('crm.contact.list', $params,
            function ($result) use (&$listItems) {
                $listItems = array_merge($listItems, $result['result']);
            }
        );
    }
    $Rest->processBatchCalls();
    $Contact = new \CCrmContact();
    $Pets = new SmartProcess\Pets();
    $arPhones = [];
    foreach ($listItems as $key => $item) {
        $name = str_replace([' ', '.', ',', '-'], ['','','','',],mb_strtolower($item["UF_CRM_1486394709"]));
        if ($id = array_search($name, $artrimBreed)) {
            $listItems[$key]["BREED_ID"] = $id;
        } elseif ($arMap[$name]) {
            $listItems[$key]["BREED_ID"] = $arMap[$name];
        } else {
            $listItems[$key]["COMMENT"] = "Автоматическое создание питомца завершилось с ошибкой. Необходимо добавить питомца с кличкой " . $item["UF_CRM_1486394722"] . "породы ".$item["UF_CRM_1486394709"];
        }
        if ($item["PHONE"][0]["VALUE"]) {
            $listItems[$key]["CONTACT_PHONE"] = $item["PHONE"][0]["VALUE"];
        } else {
            $listItems[$key]["CONTACT_PHONE"] = $item["LAST_NAME"];
        }
        if ((int)$item["LAST_NAME"] > 0) {
            $listItems[$key]["OLD_LAST_NAME"] = $item["LAST_NAME"];
            $listItems[$key]["LAST_NAME"] = '';
        }
        $arContactPets = [];
        $newPetId = 0;
        if ($listItems[$key]["BREED_ID"] > 0) {
            $birthday = '';
            if ($item["UF_CRM_1486394756"]) {
                $date = explode('T', $item["UF_CRM_1486394756"])[0];
                $birthday = new \Bitrix\Main\Type\Date($date, 'Y-m-d');
            }
            $newPetId = $Pets->add(
                [
                    "TITLE"                   => $item["UF_CRM_1486394722"],
                    $Pets->getUfBreedCode()   => $listItems[$key]["BREED_ID"],
                    $Pets->getUfPetTypeCode() => $arTypesMap[$item["UF_CRM_1486394648"]],
                    $Pets->getUfBirthdayCode() => $birthday
                ]
            );
        }
        $phone = UserPhoneAuthTable::normalizePhoneNumber($listItems[$key]["CONTACT_PHONE"]);
        if (!$arResult[$phone]) {
            $arResult[$phone] = [
                "contactData" => [
                    "NAME"                           => $item["NAME"],
                    "LAST_NAME"                           => $listItems[$key]["LAST_NAME"],
                    "TITLE"                          => $item["NAME"],
                    'FM'                             => [
                        'PHONE' => [
                            'n0' => [
                                'VALUE_TYPE' => 'WORK',
                                'VALUE'      => $phone
                            ]
                        ]
                    ],
                    "COMMENTS" => $listItems[$key]["COMMENT"],
                    Grooming\Contact::FIELD_SALON_CODE => $arSalonsMap[$item["UF_CRM_1486395038"]],
                    Grooming\Contact::FIELD_MASTER_CODE => $arSalonsMap[$item["UF_CRM_1486395061"]],
                    Grooming\Contact::FIELD_BIRTHDAY_SMS_CODE => $item["UF_CRM_1494239965"],
                    Grooming\Contact::FIELD_CLOUD_CRM_ID_CODE => $item["ID"],
                ],
                "pets" => [$newPetId]
            ];
        } else {
            $arResult[$phone]["pets"][] = $newPetId;
        }
    }

    foreach ($arResult as $phone => $data) {
        $petField = [
            Grooming\Contact::FIELD_PET_CODE => $data["pets"]
        ];
        $arFields = array_merge($petField, $data["contactData"]);
        $Contact->Add($arFields);
    }

} catch (Exception $e) {
    \Starlabs\Tools\Helpers\p::init($e->getMessage());
}*/

//$Breed = new Iblock\Breed();
//$Product = new Iblock\Products();
//$ProductRes = $Product->createQuery()
//    ->setSelect(["NAME","ID", "BREED_" =>$Product::PROP_BREED_CODE])
//    ->setFilter(['SECTION_DATA.IBLOCK_SECTION_ID' => 17])
//    ->registerRuntimeField(
//        'SECTION_DATA',
//        [
//            'data_type' => \Bitrix\Iblock\SectionTable::getEntity(),
//            'reference' => ['=this.IBLOCK_SECTION_ID' => 'ref.ID']
//        ]
//    )
//    ->exec();
//while ($arProduct = $ProductRes->fetch()) {
//    $arProductData[$arProduct["BREED_VALUE"]][$arProduct["ID"]] = $arProduct["NAME"];
//}
//
//$arBreedRes = $Breed->createQuery()
//    ->setSelect(["NAME", "ID", "asd_" => $Breed::PROP_PET_TYPE_CODE])
//    ->setFilter(["asd_VALUE" => 176])
//    ->setOrder(["NAME" => "ASC"])
//    ->exec();
//
//while ($arBreed = $arBreedRes->fetch()) {
//    $arBreeds[$arBreed["ID"]] = $arBreed["NAME"];
//}


try {
    $arSalonsMap = [
        92  => 33,
        90  => 34,
        94  => 36,
        259 => 35,
        327 => 37,
    ];
    $arMastersMap = [
        206 => 15,
        168 => 13,
        343 => 14,
        14  => 4,
        30  => 5,
        22  => 6,
        16  => 3,
        216 => 18,
        433 => 10,
        441 => 16,
        439 => 19,
        435 => 20,
        647 => 5,
    ];

    $arSectionsMap = [
        30  => "33",
        32  => "36",
        34  => "34",
        399 => "35",
        6   => "37",
    ];

    /*    $listTotalev = \Starlabs\Project\CRest\CRestCurrent::call(
            'calendar.event.get',
            [
                "type"    => "company_calendar",
                "from"    => "2021-12-21",
                "section" => ["30", "32", "34", "399", "6"]
            ]
        );

        foreach ($listTotalev["result"] as $arEvent) {
            if (in_array($arEvent["CREATED_BY"], array_keys($arMastersMap))) {
                $arEventsData[$arEvent["DATE_FROM"]][$arEvent["CREATED_BY"]] = [
                    "DATE_TO"     => $arEvent["DATE_TO"],
                    "DESCRIPTION" => $arEvent["NAME"],
                    "SALON" => $arSectionsMap[$arEvent["SECTION_ID"]]
                ];
            } else {
                foreach ($arEvent["ATTENDEE_LIST"] as $arAttendee) {
                    if (in_array($arAttendee["id"], array_keys($arMastersMap))) {
                        $arEventsData[$arEvent["DATE_FROM"]][$arAttendee["id"]] = [
                            "DATE_TO"     => $arEvent["DATE_TO"],
                            "DESCRIPTION" => $arEvent["NAME"],
                            "SALON" => $arSectionsMap[$arEvent["SECTION_ID"]]
                        ];
                        break;
                    }
                }
            }
        }*/

    $arEventsData = array
    (
        "21.12.2021 11:00:00" => array
        (
            "435" => array
            (
                "DATE_TO"     => "21.12.2021 12:30:00",
                "DESCRIPTION" => "Клиент: (йорк Бекки). Мастер: Елизавета Зиманова. Сумма: 1800.00. гигиена+ мытьё , чистка зубов пастой",
                "SALON"       => "34",
                "PRICE"       => '1800',
                "AR_CONTACT"  => [
                    "name" => 'Татьяна',
                    "id"   => '7146'
                ],
                "AR_PET"      => [
                    "name"  => 'Бекки',
                    "id"    => '18054',
                    "breed" => 'Йоркширский терьер',
                ]
            ),

            "30" => array
            (
                "DATE_TO"     => "21.12.2021 13:00:00",
                "DESCRIPTION" => "Клиент: (йорк Марко). Мастер: Россана Казакова. Сумма: 2000.00.",
                "SALON"       => "34",
                "PRICE"       => '2000',
                "AR_CONTACT"  => [
                    "name"   => 'Ангелина',
                    "id"     => '4589'
                ],
                "AR_PET" => [
                    "name"  => 'Марко',
                    "id"    => '18839',
                    "breed" => 'Йоркширский терьер',
                ]
            ),

        ),

        "21.12.2021 12:00:00" => array
        (
            "441" => array
            (
                "DATE_TO"     => "21.12.2021 13:00:00",
                "DESCRIPTION" => "Шпиц Руди на мытьё, когти,чистка ушей. Модель на Волгагрум тел.89277031147",
                "SALON"       => "37",
                "PRICE"       => '',
                "AR_CONTACT"  => [
                    "name" => 'Служебный контакт',
                    "id"   => '9613'
                ],
                "AR_PET"      => [
                    "name"  => 'Служебный питомец',
                    "id"    => '20414',
                    "breed" => 'Другое',
                ]
            ),

            "343" => array
            (
                "DATE_TO"     => "21.12.2021 14:30:00",
                "DESCRIPTION" => "Клиент: (метис шпица Маня). Мастер: Светлана Павлова. Сумма: 780.00",
                "SALON"       => "33",
                "PRICE"       => '780',
                "AR_CONTACT"  => [
                    "name" => 'Александра',
                    "id"   => '4339'
                ],
                "AR_PET"      => [
                    "name"  => 'Служебный питомец',
                    "id"    => '20414',
                    "breed" => 'Другое',
                ]
            ),

        ),

        "21.12.2021 13:00:00" => array
        (
            "22" => array
            (
                "DATE_TO"     => "21.12.2021 14:00:00",
                "DESCRIPTION" => "Клиент: (чихуа мия). Мастер:  Елизавета Зиманова. Сумма: 1000.00.",
                "SALON"       => "34",
                "PRICE"       => '1000',
                "AR_CONTACT"  => [
                    "name" => 'Юля',
                    "id"   => '7371'
                ],
                "AR_PET"      => [
                    "name"  => 'мия',
                    "id"    => '18252',
                    "breed" => 'Чи-хуа-хуа гладкошерстная',
                ]
            ),

        ),

        "21.12.2021 14:00:00" => array
        (
            "30" => array
            (
                "DATE_TO"     => "21.12.2021 16:00:00",
                "DESCRIPTION" => "Клиент: (кинг.чр.сп. Шарлотта). Мастер: Россана Казакова. Сумма: 2000.00.",
                "SALON"       => "34",
                "PRICE"       => '2000',
                "AR_CONTACT"  => [
                    "name" => 'Алла',
                    "id"   => '4472'
                ],
                "AR_PET"      => [
                    "name"  => 'Служебный питомец',
                    "id"    => '20414',
                    "breed" => 'Другое',
                ]
            ),

            "441" => array
            (
                "DATE_TO"     => "21.12.2021 16:00:00",
                "DESCRIPTION" => "Клиент:  (йорк Масяня). Мастер: Алина Матерова. Сумма: 1450.00.",
                "SALON"       => "37",
                "PRICE"       => '1450',
                "AR_CONTACT"  => [
                    "name" => 'Денис',
                    "id"   => '5096'
                ],
                "AR_PET"      => [
                    "name"  => 'Масяня',
                    "id"    => '16235',
                    "breed" => 'Йоркширский терьер',
                ]
            ),

            "206" => array
            (
                "DATE_TO"     => "21.12.2021 17:30:00",
                "DESCRIPTION" => "Клиент:  (япон.акита Анита и йорк Хлоя). Мастер: Виктория Мифтеева. Сумма: 4000.00. 8 (987) 155-73-84 10.11 за акиту внесена предоплата 990 рублей.",
                "SALON"       => "35",
                "PRICE"       => '',
                "AR_CONTACT"  => [
                    "name" => 'Маргарита',
                    "id"   => '6057'
                ],
                "AR_PET"      => [
                    "name"  => 'Анита',
                    "id"    => '20415',
                    "breed" => 'Акита ину ',
                ]
            ),

        ),

        "21.12.2021 17:00:00" => array
        (
            "206" => array
            (
                "DATE_TO"     => "21.12.2021 19:00:00",
                "DESCRIPTION" => "Клиент:  (шпиц Лордик). Мастер: Виктория Мифтеева. Сумма: 1800.00. 8 (927) 020-55-16",
                "SALON"       => "35",
                "PRICE"       => '1800',
                "AR_CONTACT"  => [
                    "name" => 'Зинаида',
                    "id"   => '5577'
                ],
                "AR_PET"      => [
                    "name"  => 'Лордик',
                    "id"    => '16661',
                    "breed" => 'Шпиц Вольф',
                ]
            ),

            "30" => array
            (
                "DATE_TO"     => "21.12.2021 19:20:00",
                "DESCRIPTION" => "Клиент:  (йорк Моника). Мастер: Россана Казакова. Сумма: 2200.00. комплекс + зубы пастой",
                "SALON"       => "34",
                "PRICE"       => '2200',
                "AR_CONTACT"  => [
                    "name" => 'Елена',
                    "id"   => '5470'
                ],
                "AR_PET"      => [
                    "name"  => 'Моника',
                    "id"    => '18869',
                    "breed" => 'Йоркширский терьер',
                ]
            ),

        ),

        "22.12.2021 11:00:00" => array
        (
            "22" => array
            (
                "DATE_TO"     => "22.12.2021 14:00:00",
                "DESCRIPTION" => "Клиент:  (кар.пудель  Мила). Мастер: Наталья Кленина. Сумма: 2000.00.",
                "SALON"       => "34",
                "PRICE"       => '2000',
                "AR_CONTACT"  => [
                    "name" => 'Елена',
                    "id"   => '5431'
                ],
                "AR_PET"      => [
                    "name"  => 'Мила',
                    "id"    => '16632',
                    "breed" => 'Пудель карликовый до 36 см',
                ]
            ),

        ),

        "22.12.2021 14:00:00" => array
        (
            "439" => array
            (
                "DATE_TO"     => "22.12.2021 16:30:00",
                "DESCRIPTION" => "Клиент:  (йорк Филипп). Мастер: Екатерина Баландина. Сумма: 1450.00. ",
                "SALON"       => "36",
                "PRICE"       => '1450',
                "AR_CONTACT"  => [
                    "name" => 'Людмила',
                    "id"   => '9614'
                ],
                "AR_PET"      => [
                    "name"  => 'Филипп',
                    "id"    => '20416',
                    "breed" => 'Йоркширский терьер',
                ]
            ),

            "343" => array
            (
                "DATE_TO"     => "22.12.2021 17:00:00",
                "DESCRIPTION" => "2 шпица Инвар и Пончик на мытьё, когти,уши. Модели для Волгагрум тел. 89277365533 Марина",
                "SALON"       => "33",
                "PRICE"       => '',
                "AR_CONTACT"  => [
                    "name" => 'Служебный контакт',
                    "id"   => '9613'
                ],
                "AR_PET"      => [
                    "name"  => 'Служебный питомец',
                    "id"    => '20414',
                    "breed" => 'Другое',
                ]
            ),

        ),

        "23.12.2021 10:00:00" => array
        (
            "14" => array
            (
                "DATE_TO"     => "23.12.2021 12:00:00",
                "DESCRIPTION" => "Клиент:  (мальтезе Веня). Мастер: Ксения Жандарова. Сумма: 2000.00.",
                "SALON"       => "34",
                "PRICE"       => '2000',
                "AR_CONTACT"  => [
                    "name" => 'Татьяна',
                    "id"   => '7207'
                ],
                "AR_PET"      => [
                    "name"  => 'Веня',
                    "id"    => '18635',
                    "breed" => 'Мальтез',
                ]
            ),

        ),

        "23.12.2021 12:00:00" => array
        (
            "433" => array
            (
                "DATE_TO"     => "23.12.2021 13:00:00",
                "DESCRIPTION" => "Настя Б. с 12:00 до 13:00 помогает Наташе и Оле",
                "SALON"       => "33",
                "PRICE"       => '',
                "AR_CONTACT"  => [
                    "name" => 'Служебный контакт',
                    "id"   => '9613'
                ],
                "AR_PET"      => [
                    "name"  => 'Служебный питомец',
                    "id"    => '20414',
                    "breed" => 'Другое',
                ]
            ),

        ),

        "23.12.2021 15:30:00" => array
        (
            "168" => array
            (
                "DATE_TO"     => "23.12.2021 16:00:00",
                "DESCRIPTION" => "Клиент:  (кот арчи). Мастер: Наталья Юнина. Сумма: 1200.00.  стрижка",
                "SALON"       => "33",
                "PRICE"       => '1200',
                "AR_CONTACT"  => [
                    "name" => 'Светлана',
                    "id"   => '6908'
                ],
                "AR_PET"      => [
                    "name"  => 'арчи',
                    "id"    => '17846',
                    "breed" => 'Кошки',
                ]
            ),

            "14" => array
            (
                "DATE_TO"     => "23.12.2021 17:30:00",
                "DESCRIPTION" => "Клиент: (Шпиц Оливия). Мастер: Ксения Жандарова. Сумма: 2000.00.",
                "SALON"       => "34",
                "PRICE"       => '2000',
                "AR_CONTACT"  => [
                    "name" => 'Яна',
                    "id"   => '7386'
                ],
                "AR_PET"      => [
                    "name"  => 'Оливия',
                    "id"    => '18266',
                    "breed" => 'Шпиц Вольф',
                ]
            ),

        ),

        "23.12.2021 16:00:00" => array
        (
            "168" => array
            (
                "DATE_TO"     => "23.12.2021 18:00:00",
                "DESCRIPTION" => "Клиент:  (Метис 6кг Ириска). Мастер: Наталья Юнина. Сумма: 1750.00.",
                "SALON"       => "33",
                "PRICE"       => '1750',
                "AR_CONTACT"  => [
                    "name" => 'Любовь',
                    "id"   => '5970'
                ],
                "AR_PET"      => [
                    "name"  => 'Ириска',
                    "id"    => '20417',
                    "breed" => 'Метис (до 7 кг)',
                ]
            ),

            "22" => array
            (
                "DATE_TO"     => "23.12.2021 19:00:00",
                "DESCRIPTION" => "Мытьё Рыжика",
                "SALON"       => "34",
                "PRICE"       => '',
                "AR_CONTACT"  => [
                    "name" => 'Служебный контакт',
                    "id"   => '9613'
                ],
                "AR_PET"      => [
                    "name"  => 'Служебный питомец',
                    "id"    => '20414',
                    "breed" => 'Другое',
                ]
            ),

        ),

        "23.12.2021 17:00:00" => array
        (
            "14" => array
            (
                "DATE_TO"     => "23.12.2021 18:30:00",
                "DESCRIPTION" => "Клиент: 8 (927) 906-00-33 (бигль Мариарти). Мастер: Ксения Жандарова. Сумма: 2000.00.",
                "SALON"       => "34",
                "PRICE"       => '2000',
                "AR_CONTACT"  => [
                    "name" => 'Ольга',
                    "id"   => '6612'
                ],
                "AR_PET"      => [
                    "name"  => 'Мариарти',
                    "id"    => '17745',
                    "breed" => 'Бигль',
                ]
            ),

        ),

        "23.12.2021 17:30:00" => array
        (
            "206" => array
            (
                "DATE_TO"     => "23.12.2021 20:00:00",
                "DESCRIPTION" => "Клиент:  (акиту-ину Мару ). Мастер: Виктория Мифтеева. Сумма: 2200.00.  20.12 внесена предоплата 1100 рублей",
                "SALON"       => "35",
                "PRICE"       => '2200',
                "AR_CONTACT"  => [
                    "name"   => 'Елена',
                    "id"     => '5465'
                ],
                "AR_PET" => [
                    "name"  => 'Мару',
                    "id"    => '20418',
                    "breed" => 'Акита ину',
                ]
            ),

        ),

        "23.12.2021 18:00:00" => array
        (
            "16" => array
            (
                "DATE_TO"     => "23.12.2021 20:00:00",
                "DESCRIPTION" => "Клиент:  (шпиц Барни). Мастер: Воронкова Елена. Сумма: 1750.00. ",
                "SALON"       => "37",
                "PRICE"       => '1750',
                "AR_CONTACT"  => [
                    "name" => 'Николай',
                    "id"   => '9277'
                ],
                "AR_PET"      => [
                    "name"  => 'Барни',
                    "id"    => '20091',
                    "breed" => 'Шпиц Вольф',
                ]
            ),

        ),

        "24.12.2021 10:00:00" => array
        (
            "22" => array
            (
                "DATE_TO"     => "24.12.2021 11:00:00",
                "DESCRIPTION" => "Аврора к Наташе",
                "SALON"       => "34",
                "PRICE"       => '',
                "AR_CONTACT"  => [
                    "name" => 'Служебный контакт',
                    "id"   => '9613'
                ],
                "AR_PET"      => [
                    "name"  => 'Служебный питомец',
                    "id"    => '20414',
                    "breed" => 'Другое',
                ]
            ),

            "433" => array
            (
                "DATE_TO"     => "24.12.2021 12:30:00",
                "DESCRIPTION" => "Настя Б. с 12:30",
                "SALON"       => "33",
                "PRICE"       => '',
                "AR_CONTACT"  => [
                    "name" => 'Служебный контакт',
                    "id"   => '9613'
                ],
                "AR_PET"      => [
                    "name"  => 'Служебный питомец',
                    "id"    => '20414',
                    "breed" => 'Другое',
                ]
            ),

            "168" => array
            (
                "DATE_TO"     => "24.12.2021 13:30:00",
                "DESCRIPTION" => "Клиент:  (малый пудель Терри ). Мастер: Наталья Юнина. Сумма: 1750.00.  хотят стрижку в Азии",
                "SALON"       => "33",
                "PRICE"       => '1750',
                "AR_CONTACT"  => [
                    "name"   => 'Татьяна',
                    "id"     => '7167'
                ],
                "AR_PET" => [
                    "name"  => 'Терри',
                    "id"    => '18074',
                    "breed" => 'Пудель той до 28 см',
                ]
            ),

        ),

        "24.12.2021 13:00:00" => array
        (
            "14" => array
            (
                "DATE_TO"     => "24.12.2021 16:00:00",
                "DESCRIPTION" => "Клиент:  (бишон Кокос). Мастер: Ксения Жандарова. Сумма: 2200.00.",
                "SALON"       => "34",
                "PRICE"       => '2200',
                "AR_CONTACT"  => [
                    "name" => 'Дарья',
                    "id"   => '9615'
                ],
                "AR_PET"      => [
                    "name"  => 'Кокос',
                    "id"    => '20419',
                    "breed" => 'Бишон',
                ]
            ),

        ),

        "24.12.2021 14:00:00" => array
        (
            "168" => array
            (
                "DATE_TO"     => "24.12.2021 16:00:00",
                "DESCRIPTION" => "Клиент:  (шпиц Джесси).  Мастер: Наталья Юнина. Сумма: 1750.00.",
                "SALON"       => "33",
                "PRICE"       => '1750',
                "AR_CONTACT"  => [
                    "name" => 'Марина',
                    "id"   => '6100'
                ],
                "AR_PET"      => [
                    "name"  => '',
                    "id"    => '17121',
                    "breed" => '',
                ]
            ),

        ),

        "24.12.2021 16:00:00" => array
        (
            "168" => array
            (
                "DATE_TO"     => "24.12.2021 18:00:00",
                "DESCRIPTION" => "Клиент:  (той пудель Тофи). Мастер: Наталья Юнина. Сумма: 1750.00. 8 (927) 200-73-90",
                "SALON"       => "33",
                "PRICE"       => '1750',
                "AR_CONTACT"  => [
                    "id" => '6919'
                ],
                "AR_PET"      => [
                    "id" => '17857',
                ]
            ),

            "22" => array
            (
                "DATE_TO"     => "24.12.2021 18:00:00",
                "DESCRIPTION" => "Фа к Наташе",
                "SALON"       => "34",
                "PRICE"       => '',
                "AR_CONTACT"  => [
                    "name" => 'Служебный контакт',
                    "id"   => '9613'
                ],
                "AR_PET"      => [
                    "name"  => 'Служебный питомец',
                    "id"    => '20414',
                    "breed" => 'Другое',
                ]
            ),

        ),

        "24.12.2021 17:00:00" => array
        (
            "14" => array
            (
                "DATE_TO"     => "24.12.2021 18:00:00",
                "DESCRIPTION" => "Клиент:  (кот Сима). Мастер: Ксения Жандарова. Сумма: 1200.00.",
                "SALON"       => "34",
                "PRICE"       => '1200',
                "AR_CONTACT"  => [
                    "id" => '9616'
                ],
                "AR_PET"      => [
                    "id" => '20421',
                ]
            ),

        ),

        "24.12.2021 18:00:00" => array
        (
            "168" => array
            (
                "DATE_TO"     => "24.12.2021 20:00:00",
                "DESCRIPTION" => "Наташа до 18:00",
                "SALON"       => "33",
                "PRICE"       => '',
                "AR_CONTACT"  => [
                    "name" => 'Служебный контакт',
                    "id"   => '9613'
                ],
                "AR_PET"      => [
                    "name"  => 'Служебный питомец',
                    "id"    => '20414',
                    "breed" => 'Другое',
                ]
            ),

        ),

        "25.12.2021 10:00:00" => array
        (
            "14" => array
            (
                "DATE_TO"     => "25.12.2021 11:00:00",
                "DESCRIPTION" => "Клиент:  (кошка Бетти). Мастер: Ксения Жандарова. Сумма: 2000.00. экс линька",
                "SALON"       => "34",
                "PRICE"       => '2000',
                "AR_CONTACT"  => [
                    "id" => '4676'
                ],
                "AR_PET"      => [
                    "id" => '15882',
                ]
            ),

            "441" => array
            (
                "DATE_TO"     => "25.12.2021 13:00:00",
                "DESCRIPTION" => "Клиент:  (метис Семен).  Мастер: Алина Матерова. Сумма: 2000.00.",
                "SALON"       => "37",
                "PRICE"       => '2000',
                "AR_CONTACT"  => [
                    "id" => '6419'
                ],
                "AR_PET"      => [
                    "id" => '17417',
                ]
            ),

        ),

        "25.12.2021 11:00:00" => array
        (
            "14" => array
            (
                "DATE_TO"     => "25.12.2021 13:00:00",
                "DESCRIPTION" => "Клиент:  (шпиц хлопа). Мастер: Ксения Жандарова. Сумма: 2000.00.",
                "SALON"       => "34",
                "PRICE"       => '2000',
                "AR_CONTACT"  => [
                    "id" => '4676'
                ],
                "AR_PET"      => [
                    "id" => '15865',
                ]
            ),

            "647" => array
            (
                "DATE_TO"     => "25.12.2021 13:00:00",
                "DESCRIPTION" => "Клиент:  (Шпиц Сем). Мастер: Россана Казакова. Сумма: 2000.00.",
                "SALON"       => "34",
                "PRICE"       => '2000',
                "AR_CONTACT"  => [
                    "id" => '5381'
                ],
                "AR_PET"      => [
                    "id" => '16490',
                ]
            ),

            "439" => array
            (
                "DATE_TO"     => "25.12.2021 13:30:00",
                "DESCRIPTION" => "Клиент:  (Йорк Гучи).  Мастер: Екатерина Баландина. Сумма: 1450.00.",
                "SALON"       => "36",
                "PRICE"       => '1450',
                "AR_CONTACT"  => [
                    "id" => '7079'
                ],
                "AR_PET"      => [
                    "id" => '17997',
                ]
            ),

        ),

        "25.12.2021 12:00:00" => array
        (
            "343" => array
            (
                "DATE_TO"     => "25.12.2021 14:30:00",
                "DESCRIPTION" => "Клиент:  (йорк Сенька). Мастер: Светлана Павлова. Сумма: 1450.00.",
                "SALON"       => "33",
                "PRICE"       => '1450',
                "AR_CONTACT"  => [
                    "id" => '6736'
                ],
                "AR_PET"      => [
                    "id" => '19004',
                ]
            ),

        ),

        "25.12.2021 14:00:00" => array
        (
            "30" => array
            (
                "DATE_TO"     => "25.12.2021 17:00:00",
                "DESCRIPTION" => "Клиент: (чихуа джони и кот). Мастер: Россана Казакова. Сумма: 2500.00.",
                "SALON"       => "34",
                "PRICE"       => '2500',
                "AR_CONTACT"  => [
                    "id" => '6676'
                ],
                "AR_PET"      => [
                    "id" => '17640',
                ]
            ),

        ),

        "25.12.2021 15:00:00" => array
        (
            "206" => array
            (
                "DATE_TO"     => "25.12.2021 16:30:00",
                "DESCRIPTION" => "Клиент:  (джек рассел Мия).  Мастер: Виктория Мифтеева. Сумма: 1600.00.",
                "SALON"       => "35",
                "PRICE"       => '1600',
                "AR_CONTACT"  => [
                    "id" => '7221'
                ],
                "AR_PET"      => [
                    "id" => '20422',
                ]
            ),

            "168" => array
            (
                "DATE_TO"     => "25.12.2021 17:00:00",
                "DESCRIPTION" => "Клиент:  (йорк Лео).  Мастер: Наталья Юнина. Сумма: 725.00. щенок",
                "SALON"       => "33",
                "PRICE"       => '725',
                "AR_CONTACT"  => [
                    "id" => '9617'
                ],
                "AR_PET"      => [
                    "id" => '20423',
                ]
            ),

            "439" => array
            (
                "DATE_TO"     => "25.12.2021 18:00:00",
                "DESCRIPTION" => "Клиент:  (Кокер.сп. Моника).  Мастер: Екатерина Баландина. Сумма: 1790.00.",
                "SALON"       => "36",
                "PRICE"       => '1790',
                "AR_CONTACT"  => [
                    "id" => '6278'
                ],
                "AR_PET"      => [
                    "id" => '20424',
                ]
            ),

        ),

        "25.12.2021 17:30:00" => array
        (
            "14" => array
            (
                "DATE_TO"     => "25.12.2021 18:30:00",
                "DESCRIPTION" => "Клиент: (Чихуа(длинош) Тучка). Мастер: Ксения Жандарова. Сумма: 1500.00.1 чихуа на железы, когти и 1 подровнять лапы",
                "SALON"       => "34",
                "PRICE"       => '1500',
                "AR_CONTACT"  => [
                    "id" => '5628'
                ],
                "AR_PET"      => [
                    "id" => '16707',
                ]
            ),

        ),

        "25.12.2021 17:00:00" => array
        (
            "647" => array
            (
                "DATE_TO"     => "25.12.2021 19:00:00",
                "DESCRIPTION" => "Клиент:  (Йорк Джони). Мастер: Россана Казакова. Сумма: 2000.00.",
                "SALON"       => "34",
                "PRICE"       => '2000',
                "AR_CONTACT"  => [
                    "id" => '7250'
                ],
                "AR_PET"      => [
                    "id" => '18145',
                ]
            ),

        ),

        "26.12.2021 10:00:00" => array
        (
            "30" => array
            (
                "DATE_TO"     => "26.12.2021 12:00:00",
                "DESCRIPTION" => "Клиент: (корги венеция). Мастер: Россана Казакова. Сумма: 1600.00.",
                "SALON"       => "34",
                "PRICE"       => '1600',
                "AR_CONTACT"  => [
                    "id" => '7265'
                ],
                "AR_PET"      => [
                    "id" => '18180',
                ]
            ),

            "14" => array
            (
                "DATE_TO"     => "26.12.2021 13:00:00",
                "DESCRIPTION" => "Клиент: Марина (вестик  тихон ). Мастер: Ксения Жандарова. Сумма: 2200.00.ком Старая цена",
                "SALON"       => "34",
                "PRICE"       => '2200',
                "AR_CONTACT"  => [
                    "id" => '6068'
                ],
                "AR_PET"      => [
                    "id" => '20425',
                ]
            ),

            "216" => array
            (
                "DATE_TO"     => "26.12.2021 13:00:00",
                "DESCRIPTION" => "Клиент:  (Шитцу Рей). Мастер: Анастасия Черноклинова. Сумма: 1450.00. ",
                "SALON"       => "33",
                "PRICE"       => '1450',
                "AR_CONTACT"  => [
                    "id" => '6628'
                ],
                "AR_PET"      => [
                    "id" => '17588',
                ]
            ),

        ),

        "26.12.2021 12:00:00" => array
        (
            "30" => array
            (
                "DATE_TO"     => "26.12.2021 14:00:00",
                "DESCRIPTION" => "Клиент:  (шпиц Буся). Мастер: Россана Казакова. Сумма: 2000.00.",
                "SALON"       => "34",
                "PRICE"       => '2000',
                "AR_CONTACT"  => [
                    "id" => '6904'
                ],
                "AR_PET"      => [
                    "id" => '17842',
                ]
            ),

            "441" => array
            (
                "DATE_TO"     => "26.12.2021 15:00:00",
                "DESCRIPTION" => "Клиент:  (спаниель Люкар).  Мастер: Алина Матерова. Сумма: 1790.00.",
                "SALON"       => "37",
                "PRICE"       => '1790',
                "AR_CONTACT"  => [
                    "id" => '6452'
                ],
                "AR_PET"      => [
                    "id" => '20426',
                ]
            ),

        ),

        "26.12.2021 13:00:00" => array
        (
            "647" => array
            (
                "DATE_TO"     => "26.12.2021 14:30:00",
                "DESCRIPTION" => "Клиент:  (шпиц Микки ). Мастер: Россана Казакова. Сумма: 1600.00. гигиена",
                "SALON"       => "34",
                "PRICE"       => '1600',
                "AR_CONTACT"  => [
                    "id" => '4540'
                ],
                "AR_PET"      => [
                    "id" => '15745',
                ]
            ),

            "216" => array
            (
                "DATE_TO"     => "26.12.2021 15:00:00",
                "DESCRIPTION" => "Клиент:  (шпиц Мася). Мастер: Анастасия Черноклинова. Сумма: 1450.00. ",
                "SALON"       => "33",
                "PRICE"       => '1450',
                "AR_CONTACT"  => [
                    "id" => '6807'
                ],
                "AR_PET"      => [
                    "id" => '17756',
                ]
            ),

            "16" => array
            (
                "DATE_TO"     => "26.12.2021 16:00:00",
                "DESCRIPTION" => "Клиент:  (Шитцу мегги). Мастер: Воронкова Елена. Сумма: 1750.00. ",
                "SALON"       => "36",
                "PRICE"       => '1750',
                "AR_CONTACT"  => [
                    "id" => '6311'
                ],
                "AR_PET"      => [
                    "id" => '17303',
                ]
            ),

        ),

        "26.12.2021 14:00:00" => array
        (
            "168" => array
            (
                "DATE_TO"     => "26.12.2021 16:00:00",
                "DESCRIPTION" => "Клиент:  (йорк Мишель). Мастер: Наталья Юнина. Сумма: 2000.00. ",
                "SALON"       => "35",
                "PRICE"       => '2000',
                "AR_CONTACT"  => [
                    "id" => '6189'
                ],
                "AR_PET"      => [
                    "id" => '17197',
                ]
            ),

        ),

        "26.12.2021 15:00:00" => array
        (
            "168" => array
            (
                "DATE_TO"     => "26.12.2021 17:00:00",
                "DESCRIPTION" => "Клиент:  (шпиц Тася). Мастер: Наталья Юнина. Сумма: 2000.00. ",
                "SALON"       => "35",
                "PRICE"       => '2000',
                "AR_CONTACT"  => [
                    "id" => '5648'
                ],
                "AR_PET"      => [
                    "id" => '16725',
                ]
            ),

        ),

        "26.12.2021 16:00:00" => array
        (
            "168" => array
            (
                "DATE_TO"     => "26.12.2021 17:00:00",
                "DESCRIPTION" => "Клиент:  (шпиц Руби и шпиц Боби ). Мастер: Наталья Юнина. Сумма: 3500.00. ",
                "SALON"       => "35",
                "PRICE"       => '3500',
                "AR_CONTACT"  => [
                    "id" => '5408'
                ],
                "AR_PET"      => [
                    "id" => '20427',
                ]
            ),

        ),

        "26.12.2021 18:00:00" => array
        (
            "216" => array
            (
                "DATE_TO"     => "26.12.2021 18:30:00",
                "DESCRIPTION" => "Клиент:  (йорк Филя). Мастер: Анастасия Черноклинова. Сумма: 600.00.  мытье",
                "SALON"       => "33",
                "PRICE"       => '600',
                "AR_CONTACT"  => [
                    "id" => '6560'
                ],
                "AR_PET"      => [
                    "id" => '17524',
                ]
            ),

            "14" => array
            (
                "DATE_TO"     => "26.12.2021 20:00:00",
                "DESCRIPTION" => "Клиент:  (йорк Лёля). Мастер: Ксения Жандарова. Сумма: 2000.00.",
                "SALON"       => "34",
                "PRICE"       => '2000',
                "AR_CONTACT"  => [
                    "id" => '7285'
                ],
                "AR_PET"      => [
                    "id" => '18179',
                ]
            ),

        ),

        "27.12.2021 10:00:00" => array
        (
            "16" => array
            (
                "DATE_TO"     => "27.12.2021 12:00:00",
                "DESCRIPTION" => "Клиент:  (Шпиц Микки). Мастер: Воронкова Елена. Сумма: 1750.00. ",
                "SALON"       => "36",
                "PRICE"       => '1750',
                "AR_CONTACT"  => [
                    "id" => '5225'
                ],
                "AR_PET"      => [
                    "id" => '16340',
                ]
            ),

            "343" => array
            (
                "DATE_TO"     => "27.12.2021 15:00:00",
                "DESCRIPTION" => "Клиент:  (вестик Фернандо). Мастер: Светлана Павлова. Сумма: 2250.00.  тримминг",
                "SALON"       => "33",
                "PRICE"       => '2250',
                "AR_CONTACT"  => [
                    "id" => '4699'
                ],
                "AR_PET"      => [
                    "id" => '20428',
                ]
            ),

        ),

        "27.12.2021 11:00:00" => array
        (
            "168" => array
            (
                "DATE_TO"     => "27.12.2021 13:00:00",
                "DESCRIPTION" => "Клиент:  (хаски рада). Мастер: Наталья Юнина. Сумма: 2300.00. 20.12 предоплата 1150 рублей",
                "SALON"       => "35",
                "PRICE"       => '2300',
                "AR_CONTACT"  => [
                    "id" => '4210'
                ],
                "AR_PET"      => [
                    "id" => '15437',
                ]
            ),

        ),

        "27.12.2021 14:00:00" => array
        (
            "168" => array
            (
                "DATE_TO"     => "27.12.2021 15:00:00",
                "DESCRIPTION" => "Клиент:  (кот мейкун Вальтер). Мастер: Наталья Юнина. Сумма: 2500.00. экспресс-линька, хозяйка принесет котика в переноске, сможет забрать в 17:00",
                "SALON"       => "35",
                "PRICE"       => '2500',
                "AR_CONTACT"  => [
                    "id" => '4998'
                ],
                "AR_PET"      => [
                    "id" => '20429',
                ]
            ),

        ),

        "27.12.2021 15:00:00" => array
        (
            "647" => array
            (
                "DATE_TO"     => "27.12.2021 18:00:00",
                "DESCRIPTION" => "Клиент:  (Шпиц Купер и йорк Джобс). Мастер: Россана Казакова. Сумма: 4000.00.",
                "SALON"       => "34",
                "PRICE"       => '4000',
                "AR_CONTACT"  => [
                    "id" => '6295'
                ],
                "AR_PET"      => [
                    "id" => '17288',
                ]
            ),

        ),

        "27.12.2021 17:00:00" => array
        (
            "435" => array
            (
                "DATE_TO"     => "27.12.2021 20:00:00",
                "DESCRIPTION" => "Клиент:  (мальтезе Бусинка). Мастер: Елизавета Зиманова. Сумма: 2000.00.",
                "SALON"       => "34",
                "PRICE"       => '2000',
                "AR_CONTACT"  => [
                    "id" => '7174'
                ],
                "AR_PET"      => [
                    "id" => '18080',
                ]
            ),

        ),

        "28.12.2021 09:00:00" => array
        (
            "206" => array
            (
                "DATE_TO"     => "28.12.2021 11:00:00",
                "DESCRIPTION" => "Пудель Марсик на мытьё тел.89198004868",
                "SALON"       => "35",
                "PRICE"       => '',
                "AR_CONTACT"  => [
                    "id" => '7938'
                ],
                "AR_PET"      => [
                    "id" => '18781',
                ]
            ),

        ),

        "28.12.2021 13:00:00" => array
        (
            "206" => array
            (
                "DATE_TO"     => "28.12.2021 15:00:00",
                "DESCRIPTION" => "Клиент:  (шпиц Феникс (Феня)). Мастер: Виктория Мифтеева. Сумма: 1800.00.",
                "SALON"       => "35",
                "PRICE"       => '1800',
                "AR_CONTACT"  => [
                    "id" => '6675'
                ],
                "AR_PET"      => [
                    "id" => '17639',
                ]
            ),

        ),

        "28.12.2021 17:00:00" => array
        (
            "30" => array
            (
                "DATE_TO"     => "28.12.2021 18:30:00",
                "DESCRIPTION" => "Клиент:  (Шпиц Яша). Мастер: Россана Казакова. Сумма: 1600.00. Старая цена",
                "SALON"       => "34",
                "PRICE"       => '1600',
                "AR_CONTACT"  => [
                    "id" => '6323'
                ],
                "AR_PET"      => [
                    "id" => '17322',
                ]
            ),

        ),

        "29.12.2021 12:00:00" => array
        (
            "22" => array
            (
                "DATE_TO"     => "29.12.2021 15:30:00",
                "DESCRIPTION" => "Клиент:  (бишон Кейси). Мастер: Наталья Кленина. Сумма: 2200.00. компл + колтуны",
                "SALON"       => "34",
                "PRICE"       => '2200',
                "AR_CONTACT"  => [
                    "id" => '9618'
                ],
                "AR_PET"      => [
                    "id" => '20430',
                ]
            ),

        ),

        "29.12.2021 15:00:00" => array
        (
            "14" => array
            (
                "DATE_TO"     => "29.12.2021 16:00:00",
                "DESCRIPTION" => "Клиент:  (мопс Эван). Мастер: Ксения Жандарова. Сумма: 1200.00. Старая цена",
                "SALON"       => "34",
                "PRICE"       => '1200',
                "AR_CONTACT"  => [
                    "id" => '4600'
                ],
                "AR_PET"      => [
                    "id" => '15805',
                ]
            ),

        ),

        "29.12.2021 16:00:00" => array
        (
            "206" => array
            (
                "DATE_TO"     => "29.12.2021 18:00:00",
                "DESCRIPTION" => "Клиент:  (Карл.Пудель Каспер). Мастер: Виктория Мифтеева. Сумма: 1900.00.  гигиена и мытье",
                "SALON"       => "35",
                "PRICE"       => '1900',
                "AR_CONTACT"  => [
                    "id" => '5317'
                ],
                "AR_PET"      => [
                    "id" => '16424',
                ]
            ),

            "14" => array
            (
                "DATE_TO"     => "29.12.2021 18:00:00",
                "DESCRIPTION" => "Клиент:  (Шпиц Арни). Мастер: Ксения Жандарова. Сумма: 2000.00. Старая цена",
                "SALON"       => "34",
                "PRICE"       => '2000',
                "AR_CONTACT"  => [
                    "id" => '4597'
                ],
                "AR_PET"      => [
                    "id" => '15793',
                ]
            ),

        ),

        "30.12.2021 10:00:00" => array
        (
            "22" => array
            (
                "DATE_TO"     => "30.12.2021 12:00:00",
                "DESCRIPTION" => "Аврора (Наташа) и Белла (Алина) на мытье",
                "SALON"       => "34",
                "PRICE"       => '',
                "AR_CONTACT"  => [
                    "name" => 'Служебный контакт',
                    "id"   => '9613'
                ],
                "AR_PET"      => [
                    "name"  => 'Служебный питомец',
                    "id"    => '20414',
                    "breed" => 'Другое',
                ]
            ),

            "168" => array
            (
                "DATE_TO"     => "30.12.2021 12:00:00",
                "DESCRIPTION" => "Клиент:  (Йорк Чубака). Мастер: Наталья Юнина. Сумма: 1750.00. ",
                "SALON"       => "33",
                "PRICE"       => '1750',
                "AR_CONTACT"  => [
                    "id" => '6003'
                ],
                "AR_PET"      => [
                    "id" => '17040',
                ]
            ),

        ),

        "30.12.2021 12:00:00" => array
        (
            "168" => array
            (
                "DATE_TO"     => "30.12.2021 13:30:00",
                "DESCRIPTION" => "Клиент:  (шпиц кевин). Мастер: Наталья Юнина. Сумма: 1600.00.  мытье и гигиена",
                "SALON"       => "33",
                "PRICE"       => '1600',
                "AR_CONTACT"  => [
                    "id" => '5056'
                ],
                "AR_PET"      => [
                    "id" => '16198',
                ]
            ),

            "22" => array
            (
                "DATE_TO"     => "30.12.2021 14:00:00",
                "DESCRIPTION" => "Фаня (Наташа) и Алиса (Алина)",
                "SALON"       => "34",
                "PRICE"       => '',
                "AR_CONTACT"  => [
                    "name" => 'Служебный контакт',
                    "id"   => '9613'
                ],
                "AR_PET"      => [
                    "name"  => 'Служебный питомец',
                    "id"    => '20414',
                    "breed" => 'Другое',
                ]
            ),

        ),

        "30.12.2021 18:00:00" => array
        (
            "439" => array
            (
                "DATE_TO"     => "30.12.2021 19:00:00",
                "DESCRIPTION" => "Шпиц Смол модель для конкурса тел.89033359128 хоз. Татьяна. Необходимо помыть, когти,чистка ушей.",
                "SALON"       => "36",
                "PRICE"       => '',
                "AR_CONTACT"  => [
                    "name" => 'Служебный контакт',
                    "id"   => '9613'
                ],
                "AR_PET"      => [
                    "name"  => 'Служебный питомец',
                    "id"    => '20414',
                    "breed" => 'Другое',
                ]
            ),

            "206" => array
            (
                "DATE_TO"     => "30.12.2021 20:00:00",
                "DESCRIPTION" => "Клиент:  (шпиц Шелби).  Мастер: Виктория Мифтеева. Сумма: 2000.00.",
                "SALON"       => "35",
                "PRICE"       => '2000',
                "AR_CONTACT"  => [
                    "id" => '4292'
                ],
                "AR_PET"      => [
                    "id" => '20431',
                ]
            ),

        ),

        "30.12.2021 16:30:00" => array
        (
            "14" => array
            (
                "DATE_TO"     => "30.12.2021 19:30:00",
                "DESCRIPTION" => "Клиент: (корги , ам.буль Каспер, Тейлор). Мастер: Ксения Жандарова. Сумма: 3100.00.",
                "SALON"       => "34",
                "PRICE"       => '3100',
                "AR_CONTACT"  => [
                    "id" => '4292'
                ],
                "AR_PET"      => [
                    "id" => '16260',
                ]
            ),

        ),

        "30.12.2021 17:00:00" => array
        (
            "22" => array
            (
                "DATE_TO"     => "30.12.2021 20:00:00",
                "DESCRIPTION" => "Мытьё Рыжика",
                "SALON"       => "34",
                "PRICE"       => '',
                "AR_CONTACT"  => [
                    "name" => 'Служебный контакт',
                    "id"   => '9613'
                ],
                "AR_PET"      => [
                    "name"  => 'Служебный питомец',
                    "id"    => '20414',
                    "breed" => 'Другое',
                ]
            ),

        ),

        "31.12.2021 10:00:00" => array
        (
            "168" => array
            (
                "DATE_TO"     => "31.12.2021 11:00:00",
                "DESCRIPTION" => "Клиент:  (папильен Эмили). Мастер: Наталья Юнина. Сумма: 600.00. ",
                "SALON"       => "33",
                "PRICE"       => '600',
                "AR_CONTACT"  => [
                    "id" => '5199'
                ],
                "AR_PET"      => [
                    "id" => '20432',
                ]
            ),

        ),

        "04.01.2022 10:00:00" => array
        (
            "14" => array
            (
                "DATE_TO"     => "04.01.2022 13:00:00",
                "DESCRIPTION" => "Клиент:  (джек рассел Арника). Мастер: Ксения Жандарова. Сумма: 2000.00.тримминг",
                "SALON"       => "34",
                "PRICE"       => '2000',
                "AR_CONTACT"  => [
                    "id" => '7304'
                ],
                "AR_PET"      => [
                    "id" => '20433',
                ]
            ),

        ),

        "04.01.2022 12:00:00" => array
        (
            "441" => array
            (
                "DATE_TO"     => "04.01.2022 13:00:00",
                "DESCRIPTION" => "Шпиц Руди на мытьё, когти,чистка ушей. Модель на Волгагрум тел.89277031147",
                "SALON"       => "37",
                "PRICE"       => '',
                "AR_CONTACT"  => [
                    "name" => 'Служебный контакт',
                    "id"   => '9613'
                ],
                "AR_PET"      => [
                    "name"  => 'Служебный питомец',
                    "id"    => '20414',
                    "breed" => 'Другое',
                ]
            ),

            "343" => array
            (
                "DATE_TO"     => "04.01.2022 14:30:00",
                "DESCRIPTION" => "Клиент:  (йорк 2 кг Лакки). Мастер: Светлана Павлова. Сумма: 780.00. ",
                "SALON"       => "33",
                "PRICE"       => '780',
                "AR_CONTACT"  => [
                    "id" => '9619'
                ],
                "AR_PET"      => [
                    "id" => '20434',
                ]
            ),

        ),

        "05.01.2022 11:00:00" => array
        (
            "14" => array
            (
                "DATE_TO"     => "05.01.2022 14:00:00",
                "DESCRIPTION" => "Клиент: (Королевский Пудель Зося). Мастер: Ксения Жандарова. Сумма: 2900.00.комп+зубы",
                "SALON"       => "34",
                "PRICE"       => '2900',
                "AR_CONTACT"  => [
                    "id" => '6838'
                ],
                "AR_PET"      => [
                    "id" => '20435',
                ]
            ),

        ),

        "05.01.2022 12:00:00" => array
        (
            "343" => array
            (
                "DATE_TO"     => "05.01.2022 15:00:00",
                "DESCRIPTION" => "2 шпица Инвар и Пончик на мытьё, когти,уши. Модели для Волгагрум тел. 89277365533 Марина",
                "SALON"       => "33",
                "PRICE"       => '',
                "AR_CONTACT"  => [
                    "name" => 'Служебный контакт',
                    "id"   => '9613'
                ],
                "AR_PET"      => [
                    "name"  => 'Служебный питомец',
                    "id"    => '20414',
                    "breed" => 'Другое',
                ]
            ),

        ),

        "05.01.2022 13:00:00" => array
        (
            "14" => array
            (
                "DATE_TO"     => "05.01.2022 15:00:00",
                "DESCRIPTION" => "Клиент:  (балонка федя). Мастер: Ксения Жандарова. Сумма: 2000.00.",
                "SALON"       => "34",
                "PRICE"       => '2000',
                "AR_CONTACT"  => [
                    "id" => '6178'
                ],
                "AR_PET"      => [
                    "id" => '17188',
                ]
            ),

        ),

        "05.01.2022 15:00:00" => array
        (
            "343" => array
            (
                "DATE_TO"     => "05.01.2022 17:00:00",
                "DESCRIPTION" => "Клиент:  (кот Чубик). Мастер: Светлана Павлова. Сумма: 2000.00. ",
                "SALON"       => "33",
                "PRICE"       => '2000',
                "AR_CONTACT"  => [
                    "id" => '6560'
                ],
                "AR_PET"      => [
                    "id" => '20436',
                ]
            ),

        ),

        "08.01.2022 12:00:00" => array
        (
            "439" => array
            (
                "DATE_TO"     => "08.01.2022 13:00:00",
                "DESCRIPTION" => "Шпиц Смол модель для конкурса тел.89033359128 хоз. Татьяна. Необходимо помыть, когти,чистка ушей.",
                "SALON"       => "36",
                "PRICE"       => '',
                "AR_CONTACT"  => [
                    "name" => 'Служебный контакт',
                    "id"   => '9613'
                ],
                "AR_PET"      => [
                    "name"  => 'Служебный питомец',
                    "id"    => '20414',
                    "breed" => 'Другое',
                ]
            ),

        ),

        "09.01.2022 10:00:00" => array
        (
            "14" => array
            (
                "DATE_TO"     => "09.01.2022 12:00:00",
                "DESCRIPTION" => "Клиент:  (той пудель Габриэлла). Мастер: Ксения Жандарова. Сумма: 900.00.",
                "SALON"       => "34",
                "PRICE"       => '900',
                "AR_CONTACT"  => [
                    "id" => '5226'
                ],
                "AR_PET"      => [
                    "id" => '16411',
                ]
            ),

        ),

        "09.01.2022 11:00:00" => array
        (
            "14" => array
            (
                "DATE_TO"     => "09.01.2022 14:00:00",
                "DESCRIPTION" => "Клиент:  (Карл.Пудель Сьюзи). Мастер: Ксения Жандарова. Сумма: 2000.00.",
                "SALON"       => "34",
                "PRICE"       => '2000',
                "AR_CONTACT"  => [
                    "id" => '5226'
                ],
                "AR_PET"      => [
                    "id" => '16341',
                ]
            ),

        ),

        "09.01.2022 13:00:00" => array
        (
            "14" => array
            (
                "DATE_TO"     => "09.01.2022 15:30:00",
                "DESCRIPTION" => "Клиент: (той пудель Нильс). Мастер: Ксения Жандарова. Сумма: 1800.00.",
                "SALON"       => "34",
                "PRICE"       => '1800',
                "AR_CONTACT"  => [
                    "id" => '5226'
                ],
                "AR_PET"      => [
                    "id" => '16416',
                ]
            ),

        ),

        "09.01.2022 16:00:00" => array
        (
            "14" => array
            (
                "DATE_TO"     => "09.01.2022 17:30:00",
                "DESCRIPTION" => "Клиент:  (Шпиц Лексик). Мастер: Ксения Жандарова. Сумма: 1600.00.",
                "SALON"       => "34",
                "PRICE"       => '1600',
                "AR_CONTACT"  => [
                    "id" => '6231'
                ],
                "AR_PET"      => [
                    "id" => '17233',
                ]
            ),

        ),

        "13.01.2022 10:00:00" => array
        (
            "206" => array
            (
                "DATE_TO"     => "13.01.2022 11:00:00",
                "DESCRIPTION" => "Клиент:  (шпиц Белла). Мастер: Виктория Мифтеева. Сумма: 1600.00.  гигиена и мытье",
                "SALON"       => "35",
                "PRICE"       => '1600',
                "AR_CONTACT"  => [
                    "id" => '7373'
                ],
                "AR_PET"      => [
                    "id" => '18254',
                ]
            ),

        ),

        "13.01.2022 11:00:00" => array
        (
            "206" => array
            (
                "DATE_TO"     => "13.01.2022 13:00:00",
                "DESCRIPTION" => "Пудель Марсик на мытьё тел.89198004868",
                "SALON"       => "35",
                "PRICE"       => '',
                "AR_CONTACT"  => [
                    "id" => '7938'
                ],
                "AR_PET"      => [
                    "id" => '18781',
                ]
            ),

        ),

        "14.01.2022 18:00:00" => array
        (
            "206" => array
            (
                "DATE_TO"     => "14.01.2022 20:30:00",
                "DESCRIPTION" => "Клиент:  (вестик веста). Мастер: Виктория Мифтеева. Сумма: 2200.00. ",
                "SALON"       => "35",
                "PRICE"       => '2200',
                "AR_CONTACT"  => [
                    "id" => '6104'
                ],
                "AR_PET"      => [
                    "id" => '20437',
                ]
            ),

        ),

        "18.01.2022 14:00:00" => array
        (
            "441" => array
            (
                "DATE_TO"     => "18.01.2022 15:00:00",
                "DESCRIPTION" => "Шпиц Руди на мытьё, когти,чистка ушей. Модель на Волгагрум тел.89277031147",
                "SALON"       => "37",
                "PRICE"       => '',
                "AR_CONTACT"  => [
                    "name" => 'Служебный контакт',
                    "id"   => '9613'
                ],
                "AR_PET"      => [
                    "name"  => 'Служебный питомец',
                    "id"    => '20414',
                    "breed" => 'Другое',
                ]
            ),

        ),

        "19.01.2022 12:00:00" => array
        (
            "343" => array
            (
                "DATE_TO"     => "19.01.2022 14:30:00",
                "DESCRIPTION" => "2 шпица Инвар и Пончик на мытьё, когти,уши. Модели для Волгагрум тел. 89277365533 Марина",
                "SALON"       => "33",
                "PRICE"       => '',
                "AR_CONTACT"  => [
                    "name" => 'Служебный контакт',
                    "id"   => '9613'
                ],
                "AR_PET"      => [
                    "name"  => 'Служебный питомец',
                    "id"    => '20414',
                    "breed" => 'Другое',
                ]
            ),

        ),

        "22.01.2022 12:00:00" => array
        (
            "439" => array
            (
                "DATE_TO"     => "22.01.2022 13:00:00",
                "DESCRIPTION" => "Шпиц Смол модель для конкурса тел.89033359128 хоз. Татьяна. Необходимо помыть, когти,чистка ушей.",
                "SALON"       => "36",
                "PRICE"       => '',
                "AR_CONTACT"  => [
                    "name" => 'Служебный контакт',
                    "id"   => '9613'
                ],
                "AR_PET"      => [
                    "name"  => 'Служебный питомец',
                    "id"    => '20414',
                    "breed" => 'Другое',
                ]
            ),

        ),

        "22.01.2022 17:00:00" => array
        (
            "22" => array
            (
                "DATE_TO"     => "22.01.2022 20:00:00",
                "DESCRIPTION" => "Клиент: (карлик пудель Тима). Мастер: Наталья Кленина. Сумма: 2000.00.",
                "SALON"       => "34",
                "PRICE"       => '2000',
                "AR_CONTACT"  => [
                    "id" => '6098'
                ],
                "AR_PET"      => [
                    "id" => '20420',
                ]
            ),

        ),

        "27.01.2022 10:00:00" => array
        (
            "206" => array
            (
                "DATE_TO"     => "27.01.2022 12:00:00",
                "DESCRIPTION" => "Пудель Марсик на мытьё тел.89198004868",
                "SALON"       => "35",
                "PRICE"       => '',
                "AR_CONTACT"  => [
                    "id" => '7938'
                ],
                "AR_PET"      => [
                    "id" => '18781',
                ]
            ),

        ),

        "29.01.2022 12:00:00" => array
        (
            "439" => array
            (
                "DATE_TO"     => "29.01.2022 13:00:00",
                "DESCRIPTION" => "Шпиц Смол модель для конкурса тел.89033359128 хоз. Татьяна. Необходимо помыть, когти,чистка ушей.",
                "SALON"       => "36",
                "PRICE"       => '',
                "AR_CONTACT"  => [
                    "name" => 'Служебный контакт',
                    "id"   => '9613'
                ],
                "AR_PET"      => [
                    "name"  => 'Служебный питомец',
                    "id"    => '20414',
                    "breed" => 'Другое',
                ]
            ),

        ),

        "31.01.2022 14:00:00" => array
        (
            "343" => array
            (
                "DATE_TO"     => "31.01.2022 17:00:00",
                "DESCRIPTION" => "2 шпица Инвар и Пончик на мытьё, когти,уши. Модели для Волгагрум тел. 89277365533 Марина",
                "SALON"       => "33",
                "PRICE"       => '',
                "AR_CONTACT"  => [
                    "name" => 'Служебный контакт',
                    "id"   => '9613'
                ],
                "AR_PET"      => [
                    "name"  => 'Служебный питомец',
                    "id"    => '20414',
                    "breed" => 'Другое',
                ]
            ),

        ),

        "01.02.2022 14:00:00" => array
        (
            "441" => array
            (
                "DATE_TO"     => "01.02.2022 15:00:00",
                "DESCRIPTION" => "Шпиц Руди на мытьё, когти,чистка ушей. Модель на Волгагрум тел.89277031147",
                "SALON"       => "37",
                "PRICE"       => '',
                "AR_CONTACT"  => [
                    "name" => 'Служебный контакт',
                    "id"   => '9613'
                ],
                "AR_PET"      => [
                    "name"  => 'Служебный питомец',
                    "id"    => '20414',
                    "breed" => 'Другое',
                ]
            ),

        )
    );

    $allEvents = $arEventsData;
    $countAllEvents = 0;
    foreach ($allEvents as $arEvent) {
        $countAllEvents += count($arEvent);
    }

    $Contact = new \CCrmContact();
    $Pets = new SmartProcess\Pets();
    $arPhones = [];
    $Breed = new Iblock\Breed();
    $Deal = new \CCrmDeal();
    $dealsCreated = 0;
    global $USER;
    foreach ($arEventsData as $dateStartStr => $arMasterRecord) {
        foreach ($arMasterRecord as $cloudMasterId => $arEvent) {
            $QueryRes = ContactTable::query()
                ->setSelect([Grooming\Contact::FIELD_PET_CODE, "ID", "NAME"])
                ->setFilter(["ID" => $arEvent["AR_CONTACT"]["id"]])
                ->exec()
                ->fetch();
            $start = new \Bitrix\Main\Type\DateTime($dateStartStr, 'd.m.Y H:i:s');
            $finish = new \Bitrix\Main\Type\DateTime($arEvent["DATE_TO"], 'd.m.Y H:i:s');
            $masterStart = $start;
            $masterFinish = $finish;
            $price = $arEvent["PRICE"];
            $Pet = $Pets->getObjectById($arEvent["AR_PET"]["id"]);
            $salonId = $arEvent["SALON"];
            $arMaster = ["id" => $arMastersMap[$cloudMasterId]];
            $arPet = [
                "name"  => $Pet->get('TITLE'),
                "id"    => $Pet->getId(),
                "breed" => $Breed->getNameById($Pet->get($Pets->getUfBreedCode()))
            ];
            $arServices = [
                [
                    "id"   => 1203,
                    "name" => "Запись из старого битрикса"
                ]
            ];
            $arClient = [
                "id"   => $QueryRes["ID"],
                "name" => $QueryRes["NAME"]
            ];
            $arFields = [
                Grooming\Deal::FIELD_MASTER_CODE             => $arMaster["id"],
                Grooming\Deal::FIELD_SALON_CODE              => $salonId,
                Grooming\Deal::FIELD_PET_CODE                => $arPet["id"],
                "CONTACT_ID"                                 => $arClient["id"],
                Grooming\Deal::FIELD_TIME_START_CODE         => $start,
                Grooming\Deal::FIELD_TIME_FINISH_CODE        => $finish,
                Grooming\Deal::FIELD_MASTER_TIME_START_CODE  => $masterStart,
                Grooming\Deal::FIELD_MASTER_TIME_FINISH_CODE => $masterFinish,
                "CATEGORY_ID"                                => Grooming\Deal::GROOMING_CATEGORY_ID,
                "OPPORTUNITY"                                => $price
            ];
            /*if ($dealId = $Deal->Add($arFields)) {
                $dealsCreated++;
                $productRows = [];
                foreach ($arServices as $arService) {
                    $strServices .= $arService["name"] . '<br>';
                    $productRows[] = [
                        "PRODUCT_ID"   => $arService["id"],
                        "PRODUCT_NAME" => $arService["name"],
                        "PRICE"        => $price
                    ];
                }
                \CCrmDeal::SaveProductRows($dealId, $productRows, true, true, false);

                $arTaskFields = [
                    "TITLE"           => "Клиент - " . $arClient["name"] . ' Питомец - ' . $arPet["name"] . ' (' . $arPet["breed"] . ')',
                    "DESCRIPTION"     => "Клиент - " . $arClient["name"] . '<br>' .
                        'Питомец - ' . $arPet["name"] . ' (' . $arPet["breed"] . ')<br>' .
                        'Описание события из старого битрикса - ' .
                        $arEvent["DESCRIPTION"] . '<br>' .
                        'Отведенное время: с ' . $start->format('H:i') . ' по ' . $finish->format(
                            'H:i'
                        ) . '<br>' .
                        'Сумма - ' . $price,
                    "RESPONSIBLE_ID"  => $arMaster["id"],
                    "UF_CRM_TASK"     => ["D_" . $dealId],
                    "GROUP_ID"        => Grooming\Tasks::GROUP_APPOINTMENT_GROOMING_ID,
                    "START_DATE_PLAN" => $start,
                    "END_DATE_PLAN"   => $finish,
                    "DEADLINE"        => $start,
                ];
//                $res = \CTaskItem::add($arTaskFields, $USER->GetID());
            }*/
        }
    }

    \Starlabs\Tools\Helpers\p::init([$countAllEvents, $dealsCreated]);
} catch (Exception$exception) {
    \Starlabs\Tools\Helpers\p::init($exception->getMessage());
}


//\Starlabs\Tools\Helpers\p::init($arProductData);
require($_SERVER["DOCUMENT_ROOT"] . "/bitrix/footer.php"); ?>